# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

x = list(map(int, input("Введите числа через пробел:\n").split()))
result = []
for i in range((len(x)+1)//2):
        result.append(x[i]*x[len(x)-1-i])
print(f'{x}=> {result}')