# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] [Негафибоначчи]


k = int(input('Введите число: '))
n_fib = [1,-1]
fib = [1,1]

for i in range(2,k):
    list = fib[i-1]+fib[i-2]
    fib.append(list)
    list_n = n_fib[i-2] - n_fib[i-1]
    n_fib.append(list_n)

n_fib.reverse()
n_fib.append(0)

print(f'[Негафибоначчи]: {n_fib+fib}')